Revit 2027 API
IConnector.Width Property
The width of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
double Width { get; }
ReadOnly Property Width As Double
	Get
property double Width {
	double get ();
}
abstract Width : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's shape is not rectangular.
Remarks
This property is used to retrieve the width of the connector.
See Also
Reference
IConnector Interface
Autodesk.Revit.DB Namespace